# სტრინკგი არის ყველაფერი რაც არის ჩასმული ბრჭყალებში და აისახება სიმბოლოებით, ინტეჯერი არის მთელი რიცხვები და ფლოატი არის წილადი რიცხვები
# string = "11" integer = 33 float = 1.4

# number = 10; წერტილმძიმე არ უნდა
# word -> "Car' უნდა იყოს ტოლობა ვორდის მერე
# print('number') # 10 შეცდომა აქ არ არის მაგრამ ჯობი არომ იყოს " " ''ს ნაცვლად
# print word ფრჩხილები აკლია

str1 = "12"
int1 = 33
print(str1 + int1) # ერორს დაბეჭდავს რადგან არ შეიძლება სტრინგის და ინტეჯერის შორის მათემატიკური ოპერაციების გაკეთება გამრავლების გარდა

print( 5 + 5)    # პასუხი იქნება 10 
print("5" + "5") # პასუხი იქნება 55
