# 1) შექმენით სახელებით სავსე სია და ასევე ცარიელი სია: Upper_name = [].  სახელების სიიდან ცარიელ სიაში ჩაამატეთ ყველა ის სახელი რომელიც იწყება დიდი ასოთი, გამოიყენეთ for ციკლი და შესაფერისი სიის და სტრინგის ფუნქციები.
l1 = ['Nika','nia','nini','nana']
upper_name =[]
for i in range(len(l1)):
    if l1[i][0] == l1[i][0].capitalize():
        upper_name.append(l1[i])
print(upper_name)

#2) შექმენით 2 სია - სახელების და გვარების. for ციკლის და ფუნქციების გამოყენებით სახელების სიაში ყველა სახელის ყველა ასო გახადეთ დიდი, ხოლო გვარების სიაში ყველა გვარის თითოეული ასო გახადეთ პატარა, სულ ბოლოს კი გააერთიანეთ სახელების სია გვარის სიასთან და დაპრინტეთ მიღებული შედეგი.
l1 =['saba','zura','soso','kaxi','petre']
l2 =['sarishvili','kvirikaze','fasisvili','fekosava']
for i in range(len(l1)):
    l1[i] = l1[i].capitalize()
for i in range(len(l2)):
    l2[i] = l2[i].lower()
l1.extend(l2)
print(l1)
# 3) შექმენით სტრინგებით სავსე სია და ამ სიიდან ამოშალეთ ყველა ის სიტყვა რომელიც არის ან 6-ზე ნაკლები სიგრძეში, ან რომელიც მთავრდება დიდი ასოთი.
l1 =['asf','ffsvfs','rewvwe','aadfdaf','vsvxz','nytgtrfn']
for i in l1:
    if len(i) < 6 or i[-1] == i[-1].capitalize:
        l1.remove(i)
print(l1) 
# 4) შექმენით float მონაცემთა ტიპის ელემენტებით სავსე სია რომელშიც იქნება 10 float ელემენტი და ამ სიიდან ახალ ცარიელ სიაში ჩაამატეთ ის რიცხვები რომლებიც არიან 10-ზე მეტი და 100-ზე ნაკლები.
l1 = [1.2,132.3,15.3,53.0,13.0,11.4,765.4,6543.1,342.2,66.3]
l2 =[]
for i in l1:
    if i > 10 and i < 100:
        l2.append(i)
print(l2)
# 5) შექმენით 2 სია, პირველი სია იყოს სავსე 5 ცალი ქალაქის სახელებით, და მეორე სიაში მოთავსებული იყოს 10 ქვეყნის სახელი. თქვენი დავალებაა რომ ქვეყნის სახელებში ჩაამატოთ ყველა ქალაქის სახელები ცალ-ცალკე მენულე ინდექსიდან მეოთხე ინდექსის ჩათვლით. გამოიყენეთ for ციკლი და შესაბამისი ფუნქციები.
l1 = ['london','dubai','tokio','otava','los angeles']
l2 = ['georgia','bangladesh','japan','serbia','germany','sudan','australia','brazil','malta','italy']
p = 0
for i in l1:
    l2.insert(l1.index(i),l1[p])
    p += 1
print(l2)