# 1)შექმენით სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიის ბოლოში დაამატე სიტყვა --> "ianvari" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა

# 2)შექმენი სია ---> [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიაში მეორე ინდექსზე დაამატე სიტყვა ---> "bati" და დაპრინტე საბოლოო სია ნახე დაემატა თუ არა

# 3)შექმენი სია ---->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიიდან ამოშალე მე 5 ინდექსზე მდგომი ელემენტი და დაპრინტე საბოლოო სია ნახე ამოიშალა თუ არა

# 4)შექმენი სია --->  [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5] ამ სიიდან ამოშალე True და ასევე ამოშალე "kote" და დაპრინტე საბოლოო სია და ნახე ამოიშალა თუ არა

l1 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
l1.append("inavari")
print(l1)

l2 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
l2.insert(2,"bati")
print(l2)

l3 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
l3.pop(5)
print(l3)

l4 = [980 , "saba", 231 , "kote" , "cico" , True , "gio" , 40.5]
l4.remove(True)
l4.remove("kote")
print(l4)