l1 = [0,1,2,3,4,5,6,7,8]
for i in l1:
    if i != 0:
        l1.remove(i)
        print(i)

# 2) შექმენით სია რომელშიც იქნება მხოლოდ სტრინგ მონაცემთა ტიპის ელემენტები, ამ სიის ბოლოში ცალ-ცალკე მეორედ ჩაამატე ყველა ის სიტყვა რაც უკვე არის ამ სიაში, გამოიყენეთ for ციკლი და სიის შესაბამისი ფუნქცია.
l2 = ['gio','nika','zuka']
new = l2[:]
for i in new:
    l2.append(i)
print(l2)

# შექმენით 2 სია, ერთში იყოს მხოლოდ სტრინგ ტიპის ელემენტები, ხოლო მეორე სავსე იყოს ინტიჯერი მონაცემთა ტიპის ელემენტებით, რიცხვებით სავსე სიიდან, სტრინგებით სავსე სიაში ჩაამატე ის რიცხვები რომლებიც არიან 20-ზე მეტი და 50-ზე ნაკლები. გამოიყენეთ for ციკლი და შესაფერისი სიის ფუნქცია.

l1 = ['asa','fdssdf','grgrg','daeafea','dsf']
l2 = [1,23,4,5,6,7,8]
for i in range(len(l2)):
    if l2[i] > 20 and l2[i] <50:
        l1.append(l2[i])
print(l1)

# შექმენით სიტყვებით სავსე სია და ამ სიაში ყველა ისეთ სიტყვას რომელიც იწყება პატარა ასოთი, პირველი ასო გაუხადეთ დიდი. გამოიყენეთ for ციკლი და სტრინგის შესაბამისი ფუნქცია.
l1 = ['dadgfa','rrhrhb','gdrbev','btrgbaf']
for i in range(len(l1)):
      l1[i] = l1[i].capitalize()
print(l1)


# capitalize ადიდებს პირველ ასოს upper ადიდებს მლიანს lower აპატარავებს მთლიანს, reverse სიას ატრიალებს append incert ამატებს ბოლოში extend ამატებს ერთ სიას მეორეს clear სიას ასუფთავებს pop და remove ამოშლის მიცემულ ატრიბუტს index აჩვენებს ობიექტის ინდექსს