# # 1)შექმენი ფუნქცია, რომელსაც აქვს ერთი პარამეტრი —name.
# ფუნქციამ უნდა დააბრუნოს ტექსტი:
# გამარჯობა, [სახელი]!

# ფუნქცია გამოიძახე სხვადასხვა არგუმენტით მინიმუმ 3-ჯერ.
def name1(name):
    return print('გამარჯობა' + name)
name1('giorgi')

# 2)შექმენი ფუნქცია, რომელსაც აქვს ორი პარამეტრი — num1 და num2.
# ფუნქციამ უნდა დააბრუნოს მათი ჯამი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f1(num1,num2):
    return print(num1 + num2)
f1(12,55)
# 3)შექმენი ფუნქცია ერთი პარამეტრით num.

# ფუნქციამ უნდა დააბრუნოს (return) გადაცემული რიცხვის კვადრატი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f2(num):
    return print(num**2)
f2(5)
# 4)შექმენი ფუნქცია ერთი პარამეტრით — age.

# თუ ასაკი არის 18 ან მეტი, დააბრუნოს:
# სრულწლოვანი ხარ

# სხვა შემთხვევაში:
# არ ხარ სრულწლოვანი
def age(num):
    if num > 18:
        return print('სრულწლოვანი')
    else:
        return print('არასრულწლოვანი')
age(27)
# 5)შექმენი ფუნქცია ერთი პარამეტრით — (string).

# ფუნქციამ უნდა დაბეჭდოს ტექსტის სიმბოლოების რაოდენობა.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f3(string):
    return print(len(string))
f3('ggesaasdfsa')
# 6)შექმენი ფუნქცია ორი პარამეტრით num1 და nuk2.

# ფუნქციამ უნდა დააბრუნოს მათი ნამრავლი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f4(num1,num2):
    return print(num1*num2)
f4(2,3)
# 7)შექმენი ფუნქცია ერთი პარამეტრით — score.

# თუ ქულა ≥ 90 → დააბრუნოს "შესანიშნავი ქულა"

# თუ ქულა >= 70 და ნაკლებია ან <=89 → დააბრუნოს "კარგი ქულა"

# თუ ქულა >= 50 და <= 69 → დააბრუნოს "დამაკმაყოფილებელი ქულა"

# სხვა შემთხვევაში დააბრუნოს "ჩაჭრილი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f5(score):
    if score >= 90:
        return print("შესანიშნავი ქულა")
    elif score >= 70:
        return print("კარგი ქულა")
    elif score >= 50 and score <= 69:
        return print("დამაკმაყოფილებელი ქულა")
    else:
        return print("ჩაჭრილი")
f5(0)
# 8)შექმენი ფუნქცია ერთი პარამეტრით — number.

# ფუნქციამ უნდა დააბრუნოს, ლუწია თუ კენტი.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f6(number):
    if number == 0:
        return print('none')
    else:
        if number % 2 == 0:
            return print('ლუწ')
        else :
            return print('კენ')
f6(-18)
# 9)შექმენი ფუნქცია ერთი პარამეტრით — name

# ფუნქციამ უნდა დააბრუნოს მხოლოდ პირველი ასო.

# მაგალითად:
# „Giorgi“ → G

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def f7(i):
    return print(i[0])
f7('giorgi')
f7('lizi')
f7('zura')
f7('saba')
# 10)შექმენი ფუნქცია სამი num1 num2 num3.

# ფუნქციამ უნდა დააბრუნოს ამ სამი რიცხვის საშუალო არითმეტიკული.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით

def f8(num1,num2,num3):
    return print((num1 + num2 + num3)/3)
f8(1,6,3)

# 11)შექმენი ფუნქცია ერთი პარამეტრით —password.

# თუ პაროლი უდრის "python123" → დააბრუნოს  "წვდომა დაშვებულია"

# სხვა შემთხვევაში → "არასწორი პაროლი"

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def pas(sword):
    if sword == "python123":
        return print("წვდომა დაშვებულია")
    else:
        return print("არასწორი პაროლი")
pas('wfaah')
# 12)შექმენი ფუნქცია ერთი პარამეტრით — text.

# ფუნქციამ უნდა დააბრუნოს ეს ტექსტი მთლიანად დიდი ასოებით.

# გამოიძახე ფუნქცია რამდენჯერმე სხვადასხვა არგუმენტებით
def f9(text):
    return print(text.upper())
f9('kebab')