# დღეს ვისწავლეთ // რომელიც გვეუბნება რამდენჯერ მოთავსდება მეორე ციფრი პირველში ** ეს არის ხარისხი და რიცხვი თავისთავზე მრავლდება მეორე რიცხვჯერ და % ეს არის მოდულიანი გაყოფა რომელსაც გამოაქვს ნაშთი
print(3//3) #= 1
print(12**2) #= 144
print(3%3) #= 0
# სია არის ცვლადი რომელსაც რამოდენიმე მნიშვნელობა გააჩნია, მას ვიყენებთ მსგავსი ინფორმაციის შესანახად რომ უფრო დალაგებულ კოდს გვაძლევს, ცვენ მერე შეგვიძლია გამოვიძახოთ სიიდან მნიშვნელობები
value_types = [True, 12, "sexnia", 22.3]
print(value_types)