# 2) შექმენით სიტყვებით სავსე სია, თუ სიტყვის ყველა ასო არის პატარა და პირველი ასო არის g, მაშინ ახალ სიაში ჩაამატეთ სახელი "Goga", თუ სიტყვის ყველა ასო არის დიდი ან იწყება ასო N-თი, მაშინ სიაში ჩაამატეთ სახელი "Nika", სხვა შემთხვევაში სიაში ჩაამატეთ სიტყვა "ლიდერი". დაპრინტეთ მიღებული სია.
l1 = ['NIKA','luka','saba','giorgi','lizi','soso','eka']
l2 = []
for i in l1:
    if i.islower() and i[0] == 'g':
        l2.append('Goga')
    elif i.isupper() or i[0] == 'N':
        l2.append('Nika')
    else:
        l2.append("ლიდერი")
print(l2)
# 3)  შექმენით რიცხვებით სავსე სია, თუ რიცხვი არის ლუწი ან დგას ლუწ ინდექსზე, ჩაამატეთ მისი კვადრატი ახალ სიაში - გამოიყენეთ შესაბამისი მათემატიკური ოპერატორი, ხოლო თუ რიცხვი არის კენტი ან დგას კენტ ინდექსზე, ახალ სიაში ჩაამატეთ 2-ჯერ დიდი რიცხვი. გამოიყენეთ while ციკლი.
l1 = [12,5,12,65,3,2367,543,2,26,878]
l2 = []
loop = 0
while loop < len(l1):
    if l1[loop] % 2 == 0 or loop % 2 == 0:
        l2.append(l1[loop]**2)
    elif l1[loop] % 2 == 1 or loop % 2 == 1:
        l2.append(l1[loop]*2)
    loop += 1
print(l2)
# 4) შექმენით სიტყვებით სავსე სია, თუ სიტყვის სიგრძე არის 6-ზე მეტი ან მისი ყველა ასო არის დიდი, ამ სიტყვის ყველა ასო გახადეთ პატარა და ჩაამატეთ ახალ სიაში. ყველა სხვა შემთხვევაში ახალ სიაში ჩაამატეთ შეუცვლელი სიტყვა ოღონდ გადაბმულად ორჯერ, მაგალითად თუ მოცემული იქნება სიტყვა "Nika", ჩაამატეთ "NikaNika". გამოიყენეთ while ციკლი.
l1 = ['words','egg','pea','fireball','lightning']
l2 = []
loop = 0
while loop < len(l1):
    if len(l1[loop]) > 6 or l1[loop].isupper():
        l2.append(l1[loop].lower())
    else:
        l2.append(l1[loop] + l1[loop])
    loop += 1
print(l2)
# 5) მოცემული გაქვთ სტრინგის ცვლადი: numbers = "0123456789", ამ სტრინგიდან ახალ სიაში ჩაამატეთ ყველა ის რიცხვი რომელიც დგას ამ სტრინგის ლუწ ინდექსზე ან არის 7-ზე მეტი, სიაში ეს რიცხვები იყოს როგორც integer ტიპის მონაცემები და არა სტრინგები. დაწერეთ ორივე ხერხით, for ციკლით და while ციკლით.
numbers = "0123456789"
l1 = []
l2 = []
for i in numbers:
    if i != '0':
        if int(i) % 2 == 0 or int(i) >7:
            l1.append(int(i))
print(l1)

loop = 0
while loop < len(numbers):
    if numbers[loop] != '0':
        if int(numbers[loop]) % 2 == 0 or int(numbers[loop]) >7:
            l2.append(int(numbers[loop]))
    loop +=1
print(l2)